diffusionFvOptions/testCases/reactingFoam_convection/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     reactingFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1.0;

deltaT          0.005;

writeControl    adjustableRunTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no; // yes;

maxCo           0.4;

libs ("libdiffusionFvOptions.so");

functions
{
    writeObjects
    {
        type            writeObjects;
        libs            ("libutilityFunctionObjects.so");

        objects         (rho h);

        writeControl    writeTime;
    }

    energyInlet
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");
        writeControl    timeStep;
        writeInterval   1;
        log             yes;
        writeTotalArea  no;
        writeFields     no;
        regionType      patch;
        name            inlet;
        operation       weightedSum;
        weightField     phi;
        fields
        (
            h
        );
    }

    energyOutlet
    {
        $energyInlet;
        name outlet;
    }

    massInlet
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");
        writeControl    timeStep;
        writeInterval   1;
        log             yes;
        writeTotalArea  no;
        writeFields     no;
        regionType      patch;
        name            inlet;
        operation       sum;
        fields
        (
            phi
        );
    }

    massOulet
    {
        $massInlet;
        name outlet;
    }
}

// ************************************************************************* //
