diffusionFvOptions/testCases/reactingFoam_convection/constant/reactions
species
(
    H2O
    N2
    CO2
);

reactions
{
}
